app/controllers/articles_controller.rb

  def index
    @articles = Article.includes(:store).all
---
SELECT "articles".* FROM "articles"
SELECT "stores".* FROM "stores" WHERE "stores"."id" IN (2)

  def new
    @article = Article.new
    @stores = Store.all
---
SELECT "stores".* FROM "stores"

  def edit
    @stores = Store.all
---
SELECT "stores".* FROM "stores"

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("name", "description", "store_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["store_id", 1], ["created_at", "2015-07-19 00:03:19.432851"], ["updated_at", "2015-07-19 00:03:19.432851"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "store_id" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["store_id", 1], ["updated_at", "2015-07-19 00:05:53.729877"], ["id", 2]]

  def services_filter
    @articles = Article.includes(:store).all
---
SELECT "articles".* FROM "articles"
SELECT "stores".* FROM "stores" WHERE "stores"."id" IN (1, 3)