app/controllers/stores_controller.rb

  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save
---
INSERT INTO "stores" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "center"], ["address", "downtown"], ["created_at", "2015-07-18 19:45:21.394561"], ["updated_at", "2015-07-18 19:45:21.394561"]]

  def services_filter
    if params.has_key?(:id)
      return get_articles
    end
    @stores = Store.all
---
SELECT "stores".* FROM "stores"

  def get_articles
    set_store
    @articles = @store.articles.includes(:store)
---
SELECT "articles".* FROM "articles" WHERE "articles"."store_id" = ?  [["store_id", 1]]
SELECT "stores".* FROM "stores" WHERE "stores"."id" IN (1)